---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingName
source: html/85466719-0ef5-463e-408e-35a6205d6c19.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ProjectBuildingName Property

"Building Name"

## Syntax (C#)
```csharp
public static ForgeTypeId ProjectBuildingName { get; }
```